hacker/_posts/2016-09-13-Best Flex Matcher.org
#+OPTIONS: H:2 num:nil tags:nil timestamps:t
#+BEGIN_EXPORT html
---
title: Best Flex Matcher
tagline: Or the smallest matching string you can get.
layout: post
author: Francis Murillo
categories: Experiment, Hacker
blog-category: hacker
tags: Emacs
---
#+END_EXPORT

* Problem

I've been using [[https://www.gnu.org/software/emacs][Emacs]] for quite some time now and used both [[https://github.com/nonsequitur/smex][smex]] and
[[https://github.com/emacs-helm/helm][helm]] as my commander. (pun somewhat intended.) But when I started, it
was just [[https://www.emacswiki.org/emacs/InteractivelyDoThings][ido]] and the phenomenal [[https://github.com/lewang/flx][flex matching]] feature which makes
command searching faster and easier. I encourage you to read or use flex
matching before continuing but the easiest explanation I can give is
that *given a list of function names and a search text, return all the
functions that contain all the letters of the search text in the
function name, sequentially*.

Not the best perhaps but I do want to stress the word *sequential*
because it is not the typical substring search. Maybe one or two
examples might help.

Let's say we have a function =emacs-lisp=, we can match it with the
substring =emacs=, =lisp= or =cs-li= but not =el= or =ep=; however, flex
matching will match =el= because =e= and =l= appear sequentially in the
name and likewise =ep= but not =me= although both letters appear in the
name but are not sequential. I love to call this kind of matching
*forward character matching* but that's just me.

After getting used to this kind matching and a thousand functions to
scan, one naturally asks the question *what is the smallest search text
that will match a target?* My sample target is =emacs-lisp-mode= and
what I hope to understand is whether =elmo= is one of the flex matching
candidate for the job.

To limit the problem so that it doesn't explode, the question is roughly
*using =smex=, what are the smallest matching search text for a
command?* So if you don't use *Emacs* or *smex* as your flex matcher,
reading this article might have little mileage for you but if you want
to hear the journey, let's ride.

* Before Coding

For those who want the code instead of a boring explanation, here it [[https://gist.github.com/FrancisMurillo/8d2d895f01d502a6d1d572190b9ef820][is]].

Here is an outline of how things would go. Given a function name, do the following

1. Check if the function exists, bail if there is not
2. Generate all possible flex matching "substring" from that name
3. For each substring, get the possible matches and rate it by order
4. Filter out those matches with the highest order

Looks simple but there is one critical thing hard with this. The word
*generate* whispers [[https://en.wikipedia.org/wiki/Combinatorial_explosion][combinatorial explosion]] which screams [[https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)][garbage
collection]] which pretty much means performance and memory problems. In
doing this in the [[http://c2.com/cgi/wiki?EmacsAsOperatingSystem][best OS]], this will block the UI which is bad like in
*JavaScript*. There are probably many ways to address this but the way I
go about it is with [[https://github.com/Reactive-Extensions/RxJS][lazy streams]] and [[http://clojure.org/reference/transducers][transducers]] which tries to
emulate [[https://tc39.github.io/ecmascript-asyncawait/][async await]]. Or I can just let the UI block for minutes while I
twiddle my thumb and be done with it but that wouldn't be fun to explore
would it?

Truly, this is article is more of an exploration of doing asynchronous
computation in *Emacs* that is inspired by solving the best flex
matching candidates. As another shameless plugs, I made the aptly named
libraries [[https://github.com/FrancisMurillo/stream.el][stream.el]], [[https://github.com/FrancisMurillo/transducer.el][transducer.el]] and [[https://github.com/FrancisMurillo/promise.el][promise.el]] to support this
endeavor. We will explore the role of each one and how it will achieve
our goals.

