hacker/_posts/2016-09-13-Best Flex Matcher.html
---
title: Best Flex Matcher
tagline: Or the smallest matching string you can get.
layout: post
author: Francis Murillo
categories: Experiment, Hacker
tags: Emacs
---

<div id="outline-container-org0ea66af" class="outline-2">
<h2 id="org0ea66af">Problem</h2>
<div class="outline-text-2" id="text-org0ea66af">
<p>
I've been using <a href="https://www.gnu.org/software/emacs">Emacs</a> for quite some time now and used both <a href="https://github.com/nonsequitur/smex">smex</a> and
<a href="https://github.com/emacs-helm/helm">helm</a> as my commander. (pun somewhat intended.) But when I started, it
was just <a href="https://www.emacswiki.org/emacs/InteractivelyDoThings">ido</a> and the phenomenal <a href="https://github.com/lewang/flx">flex matching</a> feature which makes
command searching faster and easier. I encourage you to read or use flex
matching before continuing but the easiest explanation I can give is
that *given a list of function names and a search text, return all the
functions that contain all the letters of the search text in the
function name, sequentially*.
</p>

<p>
Not the best perhaps but I do want to stress the word <b>sequential</b>
because it is not the typical substring search. Maybe one or two
examples might help.
</p>

<p>
Let's say we have a function <code>emacs-lisp</code>, we can match it with the
substring <code>emacs</code>, <code>lisp</code> or <code>cs-li</code> but not <code>el</code> or <code>ep</code>; however, flex
matching will match <code>el</code> because <code>e</code> and <code>l</code> appear sequentially in the
name and likewise <code>ep</code> but not <code>me</code> although both letters appear in the
name but are not sequential. I love to call this kind of matching
<b>forward character matching</b> but that's just me.
</p>

<p>
After getting used to this kind matching and a thousand functions to
scan, one naturally asks the question <b>what is the smallest search text
that will match a target?</b> My sample target is <code>emacs-lisp-mode</code> and
what I hope to understand is whether <code>elmo</code> is one of the flex matching
candidate for the job.
</p>

<p>
To limit the problem so that it doesn't explode, the question is roughly
<b>using <code>smex</code>, what are the smallest matching search text for a
command?</b> So if you don't use <b>Emacs</b> or <b>smex</b> as your flex matcher,
reading this article might have little mileage for you but if you want
to hear the journey, let's ride.
</p>
</div>
</div>

<div id="outline-container-org20cc4e3" class="outline-2">
<h2 id="org20cc4e3">Before Coding</h2>
<div class="outline-text-2" id="text-org20cc4e3">
<p>
For those who want the code instead of a boring explanation, here it <a href="https://gist.github.com/FrancisMurillo/8d2d895f01d502a6d1d572190b9ef820">is</a>.
</p>

<p>
Here is an outline of how things would go. Given a function name, do the following
</p>

<ol class="org-ol">
<li>Check if the function exists, bail if there is not</li>
<li>Generate all possible flex matching "substring" from that name</li>
<li>For each substring, get the possible matches and rate it by order</li>
<li>Filter out those matches with the highest order</li>
</ol>

<p>
Looks simple but there is one critical thing hard with this. The word
<b>generate</b> whispers <a href="https://en.wikipedia.org/wiki/Combinatorial_explosion">combinatorial explosion</a> which screams <a href="https://en.wikipedia.org/wiki/Garbage_collection_(computer_science)">garbage
collection</a> which pretty much means performance and memory problems. In
doing this in the <a href="http://c2.com/cgi/wiki?EmacsAsOperatingSystem">best OS</a>, this will block the UI which is bad like in
<b>JavaScript</b>. There are probably many ways to address this but the way I
go about it is with <a href="https://github.com/Reactive-Extensions/RxJS">lazy streams</a> and <a href="http://clojure.org/reference/transducers">transducers</a> which tries to
emulate <a href="https://tc39.github.io/ecmascript-asyncawait/">async await</a>. Or I can just let the UI block for minutes while I
twiddle my thumb and be done with it but that wouldn't be fun to explore
would it?
</p>

<p>
Truly, this is article is more of an exploration of doing asynchronous
computation in <b>Emacs</b> that is inspired by solving the best flex
matching candidates. As another shameless plugs, I made the aptly named
libraries <a href="https://github.com/FrancisMurillo/stream.el">stream.el</a>, <a href="https://github.com/FrancisMurillo/transducer.el">transducer.el</a> and <a href="https://github.com/FrancisMurillo/promise.el">promise.el</a> to support this
endeavor. We will explore the role of each one and how it will achieve
our goals.
</p>
</div>
</div>
