hacker/_posts/2016-09-13-Best Flex Matcher.org
* Streams

Lists. The basic form of collection. As the collection grows, mapping
over it takes longer which is natural. Dealing with a permutation of a
long text, the number of candidates can grow to millions and if a
mapping function takes time then it is compounded. What we want is to
map over a huge list without blocking, what we are really asking is to
defer the computation or be lazy. How about a snippet?

#+BEGIN_SRC emacs-lisp
  ;; Use your imagination
  (setq xs (list "a" "list" "of" "..." "a " "million " "items") ; Millions of items
        mapper (lambda (x) (list "a" "long" "operation" "on" x)) ; A long operation
        )

  (princ (mapcar mapper xs)) ; Get a cup of coffee
#+END_SRC

With =stream.el=, we can do it in a deferred fashion.

#+BEGIN_SRC emacs-lisp
  (require 'stream)

  (setq xs-stream (stream-from-list (list 1 2 3 4 5)))

  ;; Start the stream
  (princ (funcall xs-stream)) ;;> steam-start

  ;; Streams as just a function invokation
  (princ (funcall xs-stream)) ;;> 1

  ;; Invoking the stream function yields the next value
  (princ (funcall xs-stream)) ;;> 2

  (princ (funcall xs-stream)) ;;> 3
  (princ (funcall xs-stream)) ;;> 4
  (princ (funcall xs-stream)) ;;> 5

  ;; End of the stream
  (princ (funcall xs-stream)) ;;> stream-stop

  ;; No more values
  (princ (funcall xs-stream)) ;;> stream-stop
#+END_SRC

It is a little more contrived but we can say when we want the next value
with a function call. With that in mind, let's map over the stream.

#+BEGIN_SRC emacs-lisp
  (setq xs (list 1 2 3 4 5)
        mapper #'1+
        xs-stream (stream-from-list xs)
        ys-stream
        (stream
         (lambda (&rest _)
           (let ((x (funcall xs-stream)))
             ;; Common stream idiom
             ;; Ignore start-value
             (when (stream-start-value-p x)
               (setq x (funcall xs-stream)))
             ;; Handle stop-value
             (if (stream-stop-value-p x)
                 stream-stop
               ;; Actually map over it
               (funcall mapper x))))))

  (funcall ys) ;;> stream-start
  (funcall ys) ;;> 2
  (funcall ys) ;;> 3
  (funcall ys) ;;> 4
  (funcall ys) ;;> 5
  (funcall ys) ;;> 6
  (funcall ys) ;;> stream-stop
#+END_SRC

Even if =xs= is a small or huge list, we can control when the value is
computed and thus avoid blocking although the code is more verbose.
Let's apply this to our problem of generating the flex matching
candidates. Our problem of finding all flex match substrings is roughly
equivalent to printing out all binary strings of a certain length. With
the help of inductive reasoning and recursion, we have the following
implementation.

#+BEGIN_SRC emacs-lisp
  (require 'dash)

  (require 'transducer)

  (defun fbo/text-forward-permutations (text)
    (letrec ((recurser
              (lambda (sub-text)
                (cond
                 ((string-empty-p sub-text) ;; Base cases
                  (list ""))
                 ((= (length sub-text) 1)
                  (list sub-text ""))
                 ((= (length sub-text) 2) ;; Optimized non-trivial case
                  (list
                   ""
                   (substring-no-properties sub-text 0 1)
                   (substring-no-properties sub-text 1 2)
                   sub-text))
                 (t   ;; Inductive case
                  (lexical-let* ((first-text
                                  (substring-no-properties sub-text 0 1))
                                 (rest-text
                                  (substring-no-properties sub-text 1)))
                    (lexical-let* ((rest-permutations (funcall recurser rest-text)))
                      (append
                       (transducer-transduce
                        (transducer-map (-partial #'concat first-text))
                        (transducer-list-reducer)
                        rest-permutations)
                       rest-permutations))))))))
      (funcall recurser text)))
#+END_SRC

This is the original implementation with =transducers= which in this
case is an equivalent of =mapcar=. Take your time to grok it or use it
if you can. Now if you do, try running =(fbo/text-forward-permutations
"emacs-lisp-mode")= and tell me how long it took to complete it? If it
ran without blocking a bit, then I envy your hardware specs. Now let us
see convert the blocking lists to lazy streams.

#+BEGIN_SRC emacs-lisp
  (require 'transducer)

  (defun fb/text-forward-permutations (text)
    (letrec ((recurser
         (lambda (sub-text)
           (cond
            ((string-empty-p sub-text)
             (stream-from-list (list "")))
            ((= (length sub-text) 1)
             (stream-from-list (list sub-text "")))
            ((= (length sub-text) 2)
             (stream-from-list
              (list
               ""
               (substring-no-properties sub-text 0 1)
               (substring-no-properties sub-text 1 2)
               sub-text)))
            (t
             (lexical-let* ((first-text
                  (substring-no-properties sub-text 0 1))
                 (rest-text
                  (substring-no-properties sub-text 1)))
               (lexical-let* ((rest-permutations (funcall recurser rest-text))
                   (repeat-permutations (stream-copy 'empty rest-permutations))
                   (base-stream (car repeat-permutations))
                   (next-stream (cdr repeat-permutations)))
                 (stream-append
                  (transducer-transduce-stream
                   (transducer-map (-partial #'concat first-text))
                   base-stream)
                  next-stream))))))))
      (funcall recurser text)))
#+END_SRC

Did you notice the difference? At the surface, it just basically wrapped
the list return as streams. At a deeper look, there is an additional
=stream-copy= function and the destructuring of it with =base-stream=
and =next-stream=. This is the fundamental difference between lists and
streams: *lists can be consumed repeatedly while streams are not.* In
the =stream= example above, once you reach =stream-stop= you cannot go
back to the beginning which implies that a stream can only be consumed
once. So if you want to reuse the stream with their values, one has to
copy it with =stream-copy=. The other thing is how it is consumed; lists
are data structures while streams are function closures. Despite these
two fundamental differences, it was easy to switch from a list to a
stream implementation thanks to the abstraction of =transducers=.

So what we have now is the first part of the algorithm, now we can move
on to figuring out how to get the candidates or matches given a
substring.

