hacker/_posts/2016-09-13-Best Flex Matcher.html

<div id="outline-container-orgfbb50da" class="outline-2">
<h2 id="orgfbb50da">Streams</h2>
<div class="outline-text-2" id="text-orgfbb50da">
<p>
Lists. The basic form of collection. As the collection grows, mapping
over it takes longer which is natural. Dealing with a permutation of a
long text, the number of candidates can grow to millions and if a
mapping function takes time then it is compounded. What we want is to
map over a huge list without blocking, what we are really asking is to
defer the computation or be lazy. How about a snippet?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Use your imagination</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> xs <span style="color: #ff1493;">(</span>list <span style="color: #68f6cb;">"a"</span> <span style="color: #68f6cb;">"list"</span> <span style="color: #68f6cb;">"of"</span> <span style="color: #68f6cb;">"..."</span> <span style="color: #68f6cb;">"a "</span> <span style="color: #68f6cb;">"million "</span> <span style="color: #68f6cb;">"items"</span><span style="color: #ff1493;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">Millions of items</span>
      mapper <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #7fff00;">(</span>x<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span>list <span style="color: #68f6cb;">"a"</span> <span style="color: #68f6cb;">"long"</span> <span style="color: #68f6cb;">"operation"</span> <span style="color: #68f6cb;">"on"</span> x<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">A long operation</span>
      <span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>mapcar mapper xs<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">Get a cup of coffee</span>
</pre>
</div>

<p>
With <code>stream.el</code>, we can do it in a deferred fashion.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">stream</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> xs-stream <span style="color: #ff1493;">(</span>stream-from-list <span style="color: #7fff00;">(</span>list 1 2 3 4 5<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Start the stream</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; steam-start</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Streams as just a function invokation</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 1</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Invoking the stream function yields the next value</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 2</span>

<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 3</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 4</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 5</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">End of the stream</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; stream-stop</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">No more values</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall xs-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; stream-stop</span>
</pre>
</div>

<p>
It is a little more contrived but we can say when we want the next value
with a function call. With that in mind, let's map over the stream.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> xs <span style="color: #ff1493;">(</span>list 1 2 3 4 5<span style="color: #ff1493;">)</span>
      mapper #'1+
      xs-stream <span style="color: #ff1493;">(</span>stream-from-list xs<span style="color: #ff1493;">)</span>
      ys-stream
      <span style="color: #ff1493;">(</span>stream
       <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #00bfff;">(</span><span style="color: #f5b55f;">&amp;rest</span> _<span style="color: #00bfff;">)</span>
         <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">let</span> <span style="color: #ffff00;">(</span><span style="color: #da70d6;">(</span>x <span style="color: #00ff7f;">(</span>funcall xs-stream<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
           <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Common stream idiom</span>
           <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Ignore start-value</span>
           <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> <span style="color: #da70d6;">(</span>stream-start-value-p x<span style="color: #da70d6;">)</span>
             <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> x <span style="color: #00ff7f;">(</span>funcall xs-stream<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
           <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Handle stop-value</span>
           <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> <span style="color: #da70d6;">(</span>stream-stop-value-p x<span style="color: #da70d6;">)</span>
               stream-stop
             <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Actually map over it</span>
             <span style="color: #da70d6;">(</span>funcall mapper x<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>funcall ys<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; stream-start</span>
<span style="color: #ff8c00;">(</span>funcall ys<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 2</span>
<span style="color: #ff8c00;">(</span>funcall ys<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 3</span>
<span style="color: #ff8c00;">(</span>funcall ys<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 4</span>
<span style="color: #ff8c00;">(</span>funcall ys<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 5</span>
<span style="color: #ff8c00;">(</span>funcall ys<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 6</span>
<span style="color: #ff8c00;">(</span>funcall ys<span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; stream-stop</span>
</pre>
</div>

<p>
Even if <code>xs</code> is a small or huge list, we can control when the value is
computed and thus avoid blocking although the code is more verbose.
Let's apply this to our problem of generating the flex matching
candidates. Our problem of finding all flex match substrings is roughly
equivalent to printing out all binary strings of a certain length. With
the help of inductive reasoning and recursion, we have the following
implementation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">dash</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">transducer</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fbo/text-forward-permutations</span> <span style="color: #ff1493;">(</span>text<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">letrec</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>recurser
            <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>sub-text<span style="color: #da70d6;">)</span>
              <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">cond</span>
               <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>string-empty-p sub-text<span style="color: #ff8247;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Base cases</span>
                <span style="color: #ff8247;">(</span>list <span style="color: #68f6cb;">""</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
               <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>= <span style="color: #9cb6ad;">(</span>length sub-text<span style="color: #9cb6ad;">)</span> 1<span style="color: #ff8247;">)</span>
                <span style="color: #ff8247;">(</span>list sub-text <span style="color: #68f6cb;">""</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
               <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>= <span style="color: #9cb6ad;">(</span>length sub-text<span style="color: #9cb6ad;">)</span> 2<span style="color: #ff8247;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Optimized non-trivial case</span>
                <span style="color: #ff8247;">(</span>list
                 <span style="color: #68f6cb;">""</span>
                 <span style="color: #9cb6ad;">(</span>substring-no-properties sub-text 0 1<span style="color: #9cb6ad;">)</span>
                 <span style="color: #9cb6ad;">(</span>substring-no-properties sub-text 1 2<span style="color: #9cb6ad;">)</span>
                 sub-text<span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
               <span style="color: #00ff7f;">(</span>t   <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Inductive case</span>
                <span style="color: #ff8247;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #9cb6ad;">(</span><span style="color: #ff8c00;">(</span>first-text
                                <span style="color: #ff1493;">(</span>substring-no-properties sub-text 0 1<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
                               <span style="color: #ff8c00;">(</span>rest-text
                                <span style="color: #ff1493;">(</span>substring-no-properties sub-text 1<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
                  <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span>rest-permutations <span style="color: #7fff00;">(</span>funcall recurser rest-text<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
                    <span style="color: #ff8c00;">(</span>append
                     <span style="color: #ff1493;">(</span>transducer-transduce
                      <span style="color: #7fff00;">(</span>transducer-map <span style="color: #00bfff;">(</span>-partial #'concat first-text<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
                      <span style="color: #7fff00;">(</span>transducer-list-reducer<span style="color: #7fff00;">)</span>
                      rest-permutations<span style="color: #ff1493;">)</span>
                     rest-permutations<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>funcall recurser text<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
This is the original implementation with <code>transducers</code> which in this
case is an equivalent of <code>mapcar</code>. Take your time to grok it or use it
if you can. Now if you do, try running <code>(fbo/text-forward-permutations
"emacs-lisp-mode")</code> and tell me how long it took to complete it? If it
ran without blocking a bit, then I envy your hardware specs. Now let us
see convert the blocking lists to lazy streams.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">transducer</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/text-forward-permutations</span> <span style="color: #ff1493;">(</span>text<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">letrec</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>recurser
       <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>sub-text<span style="color: #da70d6;">)</span>
         <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">cond</span>
          <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>string-empty-p sub-text<span style="color: #ff8247;">)</span>
           <span style="color: #ff8247;">(</span>stream-from-list <span style="color: #9cb6ad;">(</span>list <span style="color: #68f6cb;">""</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
          <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>= <span style="color: #9cb6ad;">(</span>length sub-text<span style="color: #9cb6ad;">)</span> 1<span style="color: #ff8247;">)</span>
           <span style="color: #ff8247;">(</span>stream-from-list <span style="color: #9cb6ad;">(</span>list sub-text <span style="color: #68f6cb;">""</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
          <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>= <span style="color: #9cb6ad;">(</span>length sub-text<span style="color: #9cb6ad;">)</span> 2<span style="color: #ff8247;">)</span>
           <span style="color: #ff8247;">(</span>stream-from-list
            <span style="color: #9cb6ad;">(</span>list
             <span style="color: #68f6cb;">""</span>
             <span style="color: #ff8c00;">(</span>substring-no-properties sub-text 0 1<span style="color: #ff8c00;">)</span>
             <span style="color: #ff8c00;">(</span>substring-no-properties sub-text 1 2<span style="color: #ff8c00;">)</span>
             sub-text<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
          <span style="color: #00ff7f;">(</span>t
           <span style="color: #ff8247;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #9cb6ad;">(</span><span style="color: #ff8c00;">(</span>first-text
                <span style="color: #ff1493;">(</span>substring-no-properties sub-text 0 1<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span>rest-text
                <span style="color: #ff1493;">(</span>substring-no-properties sub-text 1<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
             <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span>rest-permutations <span style="color: #7fff00;">(</span>funcall recurser rest-text<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
                 <span style="color: #ff1493;">(</span>repeat-permutations <span style="color: #7fff00;">(</span>stream-copy 'empty rest-permutations<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
                 <span style="color: #ff1493;">(</span>base-stream <span style="color: #7fff00;">(</span>car repeat-permutations<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
                 <span style="color: #ff1493;">(</span>next-stream <span style="color: #7fff00;">(</span>cdr repeat-permutations<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span>stream-append
                <span style="color: #ff1493;">(</span>transducer-transduce-stream
                 <span style="color: #7fff00;">(</span>transducer-map <span style="color: #00bfff;">(</span>-partial #'concat first-text<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
                 base-stream<span style="color: #ff1493;">)</span>
                next-stream<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>funcall recurser text<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Did you notice the difference? At the surface, it just basically wrapped
the list return as streams. At a deeper look, there is an additional
<code>stream-copy</code> function and the destructuring of it with <code>base-stream</code>
and <code>next-stream</code>. This is the fundamental difference between lists and
streams: <b>lists can be consumed repeatedly while streams are not.</b> In
the <code>stream</code> example above, once you reach <code>stream-stop</code> you cannot go
back to the beginning which implies that a stream can only be consumed
once. So if you want to reuse the stream with their values, one has to
copy it with <code>stream-copy</code>. The other thing is how it is consumed; lists
are data structures while streams are function closures. Despite these
two fundamental differences, it was easy to switch from a list to a
stream implementation thanks to the abstraction of <code>transducers</code>.
</p>

<p>
So what we have now is the first part of the algorithm, now we can move
on to figuring out how to get the candidates or matches given a
substring.
</p>
</div>
</div>
