hacker/_posts/2016-09-13-Best Flex Matcher.org
* Transducers

So we have lazy streams but that doesn't stop it from consuming a list
of million items and taking its sweet time mapping over it. Let's
checkout how to get the candidates of a flex match with =smex= while
suspending your disbelief for =transducers= for now.

#+BEGIN_SRC emacs-lisp
  (require 's)
  (require 'dash)

  (require 'stream)
  (require 'transducer)

  (defun fb/function-symbol-stream ()
    (transducer-transduce-stream
     (transducer-map #'car)
     (stream-from-list smex-cache)))

  (defun fb/flex-match-text (text)
    (concat
     (regexp-quote (string (aref text 0)))
     (mapconcat
      (lambda (c)
        (concat "[^" (string c) "]*"
                (regexp-quote (string c))))
      (substring text 1) "")))
#+END_SRC

The main idea is to convert the =smex-cache= into a list of function
names with =fb/function-symbol-stream= which is our source of truth. Of
course, it is stream that emits symbols, so we massaged or mapped it a
bit from the =smex-cache= cons list.

Now how do we filter which is our candidates? We convert the search text
into a regex with =fb/flex-match-text= and filter the source stream with
it, which I just plundered from =ido=. To get a grasp of this, let's use
=elmo= as a substring. Using =(fb/flex-match-text "elmo")=, it would
output =e[^l]*l[^m]*m[^o]*o=, looks weird but it does its job. Testing
it out with =(s-match "e[^l]*l[^m]*m[^o]*o" "emacs-lisp-mode")= outputs
=("emacs-lisp-mo")=, so it works, hopefully.

So we now have a filterer, all we need is a =stream-filter=. It would
just take a few lines of code to implement. If in the future we want to
switch from a =stream= to a =list= because streams is a bit more
complicated, we will have no reuse and have to replace every instance of
=stream-filter= and =stream-map= to =-filter= and =-map=. So how do we
abstract the operation over the collection?

=transducers=. If you been using =map=, =filter=, or =reduce= in your
code, then =transducers= allows the trio of operations on most
collection data types such as =vector=, =sequence= and more. This is
admittedly another abstraction over the collection that might not be
warranted if you noticed the verbosity of the code but I assure you
there is another benefit we can reap from it.

Well, I am not the authority to talk about it and I just took it from
Rich Hickey's explanation of Closure transducer and I might as well have
used an Emacs to Clojure library instead of creating my own. As a
budding lisper, I found the challenge of implementing both =stream.el=
and =transducer.el= as a way to improve my elisp coding and
understanding transducers at an implementation level. Transducers are
great and a nice thing to study and use as well as the inspiration from
it. Rolling with =transducer.el=, let's see how it is used.

I urge you to read transducers from Clojure before continuing since I
might not do it justice. What I can show you is a comparison of the
standard and transducing way.

#+BEGIN_SRC emacs-lisp
  (require 'dash)
  (require 'transducer)

  ;; Mapping
  (setq xs (list 1 2 3 4 5)
        mapper #'number-to-string)

  ;; Standard mapping
  (princ (-map mapper xs)) ;;> 2 3 4 5 6

  ;; Transducer mapping
  (princ
   (transducer-transduce
    (transducer-map mapper)
    (transducer-list-reducer)
    xs))


  ;; Filtering
  (setq ys (list 1 2 3 4 5)
        filterer #'oddp)

  ;; Standard filtering
  (princ (-filter filterer ys)) ;;> 1 3 5

  ;; Transducer filtering
  (princ
   (transducer-transduce
    (transducer-filter filterer)
    (transducer-list-reducer)
    ys))


  ;; Composition
  (setq zs (list 1 2 3 4 5)
        mapper #'1+
        filterer #'evenp)

  ;; Standard composition
  ;; We can't use `-compose'
  (princ
   (-filter
    filterer
    (-map
     mapper
     xs))) ;;> 2 4 6

  ;; Transducer composition
  (princ
   (transducer-transduce
    (transducer-composes
     (transducer-map mapper)
     (transducer-filter filterer))
    (transducer-list-reducer)
    xs))
#+END_SRC

So with just plain mapping and filtering, the standard way seem better
too. The time it shines when there is composition of operation, the form
is much more readable and better. This works for streams as promised
with a slight variation.

#+BEGIN_SRC emacs-lisp
  (setq xs (list 1 2 3 4 5)
        xs-stream (stream-from-list xs)
        mapper #'1+
        filterer #'evenp)

  ;; Transducer composition with a stream
  (princ
   (stream-to-list
    (transducer-trgansduce-stream
     (transducer-composes
      (transducer-map mapper)
      (transducer-filter filterer))
     (stream-from-list xs))))
#+END_SRC

As you can see it looks similar with streams and thus everything can be
carried over. Cool. But the most striking of all benefits of a
transducer is that it is lazy or more composable. As a lead, how about
filtering a collection of numbers with two predicates.

#+BEGIN_SRC emacs-lisp
  (setq less-than-ten-p (lambda (n) (< n 10))
        more-than-five-p (lambda (n) (> n 5))
        xs (number-sequence 0 10))

  (princ ;; Remember me?
   (-filter
    less-than-ten-p
    (-filter
     more-than-five-p
     xs))) ;;> 6 7 8 9
#+END_SRC

What this does is filter the whole collection and then filter again the
smaller collection. Of course, you can optimize this by composing the
predicates so that it would only filter once. However, the composition
of transducers and the laziness of streams, this is already inherent
about it. No need to optimize how the operations interact, it will be
optimized most of the time. This performance benefit alone is why I am
advocating transducers so that majority of the symbol stream can be
skipped and avoid heavily computing the candidates if possible. I think
[[https://github.com/Reactive-Extensions/RxJS][RxJS]] has a better explanation of the optimization the API does when
composing mappings and predicates.

So with that, here is the long awaited candidate rater.

#+BEGIN_SRC emacs-lisp
  (defun fb/rate-flex-match (search target)
    (transducer-transduce-stream
     (transducer-composes
      (transducer-map-indexed #'cons)
      (transducer-first
       (lambda (pair)
         (string-equal (cdr pair) target))))
     (fb/flex-match-symbol-stream
      search
      (fb/function-symbol-stream))))
#+END_SRC

What this returns is a single valued stream of a cons pair where the car
is the index of the target function in the sorted candidate list
generated by =smex=. The index will be our rating: if the target appears
first on the list, the rating would be 0. What we want is a rating of 0
but you can be a bit more loose if you don't mind scrolling a bit to
select the command. Since the return value is a stream, you have to
unwrap with preferably =stream-to-list= and get the first value, just
take note.

So let's take all this to one proof.

