hacker/_posts/2016-09-13-Best Flex Matcher.html

<div id="outline-container-org4cf1d37" class="outline-2">
<h2 id="org4cf1d37">Transducers</h2>
<div class="outline-text-2" id="text-org4cf1d37">
<p>
So we have lazy streams but that doesn't stop it from consuming a list
of million items and taking its sweet time mapping over it. Let's
checkout how to get the candidates of a flex match with <code>smex</code> while
suspending your disbelief for <code>transducers</code> for now.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">s</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">dash</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">stream</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">transducer</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/function-symbol-stream</span> <span style="color: #ff1493;">()</span>
  <span style="color: #ff1493;">(</span>transducer-transduce-stream
   <span style="color: #7fff00;">(</span>transducer-map #'car<span style="color: #7fff00;">)</span>
   <span style="color: #7fff00;">(</span>stream-from-list smex-cache<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/flex-match-text</span> <span style="color: #ff1493;">(</span>text<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span>concat
   <span style="color: #7fff00;">(</span>regexp-quote <span style="color: #00bfff;">(</span>string <span style="color: #ffff00;">(</span>aref text 0<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
   <span style="color: #7fff00;">(</span>mapconcat
    <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ffff00;">(</span>c<span style="color: #ffff00;">)</span>
      <span style="color: #ffff00;">(</span>concat <span style="color: #68f6cb;">"[</span><span style="color: #ff694d;">^</span><span style="color: #68f6cb;">"</span> <span style="color: #da70d6;">(</span>string c<span style="color: #da70d6;">)</span> <span style="color: #68f6cb;">"]*"</span>
              <span style="color: #da70d6;">(</span>regexp-quote <span style="color: #00ff7f;">(</span>string c<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
    <span style="color: #00bfff;">(</span>substring text 1<span style="color: #00bfff;">)</span> <span style="color: #68f6cb;">""</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
The main idea is to convert the <code>smex-cache</code> into a list of function
names with <code>fb/function-symbol-stream</code> which is our source of truth. Of
course, it is stream that emits symbols, so we massaged or mapped it a
bit from the <code>smex-cache</code> cons list.
</p>

<p>
Now how do we filter which is our candidates? We convert the search text
into a regex with <code>fb/flex-match-text</code> and filter the source stream with
it, which I just plundered from <code>ido</code>. To get a grasp of this, let's use
<code>elmo</code> as a substring. Using <code>(fb/flex-match-text "elmo")</code>, it would
output <code>e[^l]*l[^m]*m[^o]*o</code>, looks weird but it does its job. Testing
it out with <code>(s-match "e[^l]*l[^m]*m[^o]*o" "emacs-lisp-mode")</code> outputs
<code>("emacs-lisp-mo")</code>, so it works, hopefully.
</p>

<p>
So we now have a filterer, all we need is a <code>stream-filter</code>. It would
just take a few lines of code to implement. If in the future we want to
switch from a <code>stream</code> to a <code>list</code> because streams is a bit more
complicated, we will have no reuse and have to replace every instance of
<code>stream-filter</code> and <code>stream-map</code> to <code>-filter</code> and <code>-map</code>. So how do we
abstract the operation over the collection?
</p>

<p>
<code>transducers</code>. If you been using <code>map</code>, <code>filter</code>, or <code>reduce</code> in your
code, then <code>transducers</code> allows the trio of operations on most
collection data types such as <code>vector</code>, <code>sequence</code> and more. This is
admittedly another abstraction over the collection that might not be
warranted if you noticed the verbosity of the code but I assure you
there is another benefit we can reap from it.
</p>

<p>
Well, I am not the authority to talk about it and I just took it from
Rich Hickey's explanation of Closure transducer and I might as well have
used an Emacs to Clojure library instead of creating my own. As a
budding lisper, I found the challenge of implementing both <code>stream.el</code>
and <code>transducer.el</code> as a way to improve my elisp coding and
understanding transducers at an implementation level. Transducers are
great and a nice thing to study and use as well as the inspiration from
it. Rolling with <code>transducer.el</code>, let's see how it is used.
</p>

<p>
I urge you to read transducers from Clojure before continuing since I
might not do it justice. What I can show you is a comparison of the
standard and transducing way.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">dash</span><span style="color: #ff8c00;">)</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">transducer</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Mapping</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> xs <span style="color: #ff1493;">(</span>list 1 2 3 4 5<span style="color: #ff1493;">)</span>
      mapper #'number-to-string<span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Standard mapping</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>-map mapper xs<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 2 3 4 5 6</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Transducer mapping</span>
<span style="color: #ff8c00;">(</span>princ
 <span style="color: #ff1493;">(</span>transducer-transduce
  <span style="color: #7fff00;">(</span>transducer-map mapper<span style="color: #7fff00;">)</span>
  <span style="color: #7fff00;">(</span>transducer-list-reducer<span style="color: #7fff00;">)</span>
  xs<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>


<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Filtering</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> ys <span style="color: #ff1493;">(</span>list 1 2 3 4 5<span style="color: #ff1493;">)</span>
      filterer #'oddp<span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Standard filtering</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>-filter filterer ys<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 1 3 5</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Transducer filtering</span>
<span style="color: #ff8c00;">(</span>princ
 <span style="color: #ff1493;">(</span>transducer-transduce
  <span style="color: #7fff00;">(</span>transducer-filter filterer<span style="color: #7fff00;">)</span>
  <span style="color: #7fff00;">(</span>transducer-list-reducer<span style="color: #7fff00;">)</span>
  ys<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>


<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Composition</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> zs <span style="color: #ff1493;">(</span>list 1 2 3 4 5<span style="color: #ff1493;">)</span>
      mapper #'1+
      filterer #'evenp<span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Standard composition</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">We can't use `</span><span style="color: #afc0fd; font-weight: bold;">-compose</span><span style="color: #2872b2;">'</span>
<span style="color: #ff8c00;">(</span>princ
 <span style="color: #ff1493;">(</span>-filter
  filterer
  <span style="color: #7fff00;">(</span>-map
   mapper
   xs<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 2 4 6</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Transducer composition</span>
<span style="color: #ff8c00;">(</span>princ
 <span style="color: #ff1493;">(</span>transducer-transduce
  <span style="color: #7fff00;">(</span>transducer-composes
   <span style="color: #00bfff;">(</span>transducer-map mapper<span style="color: #00bfff;">)</span>
   <span style="color: #00bfff;">(</span>transducer-filter filterer<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
  <span style="color: #7fff00;">(</span>transducer-list-reducer<span style="color: #7fff00;">)</span>
  xs<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
So with just plain mapping and filtering, the standard way seem better
too. The time it shines when there is composition of operation, the form
is much more readable and better. This works for streams as promised
with a slight variation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> xs <span style="color: #ff1493;">(</span>list 1 2 3 4 5<span style="color: #ff1493;">)</span>
      xs-stream <span style="color: #ff1493;">(</span>stream-from-list xs<span style="color: #ff1493;">)</span>
      mapper #'1+
      filterer #'evenp<span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Transducer composition with a stream</span>
<span style="color: #ff8c00;">(</span>princ
 <span style="color: #ff1493;">(</span>stream-to-list
  <span style="color: #7fff00;">(</span>transducer-trgansduce-stream
   <span style="color: #00bfff;">(</span>transducer-composes
    <span style="color: #ffff00;">(</span>transducer-map mapper<span style="color: #ffff00;">)</span>
    <span style="color: #ffff00;">(</span>transducer-filter filterer<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
   <span style="color: #00bfff;">(</span>stream-from-list xs<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
As you can see it looks similar with streams and thus everything can be
carried over. Cool. But the most striking of all benefits of a
transducer is that it is lazy or more composable. As a lead, how about
filtering a collection of numbers with two predicates.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> less-than-ten-p <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #7fff00;">(</span>n<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span>&lt; n 10<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
      more-than-five-p <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #7fff00;">(</span>n<span style="color: #7fff00;">)</span> <span style="color: #7fff00;">(</span>&gt; n 5<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
      xs <span style="color: #ff1493;">(</span>number-sequence 0 10<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>princ <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Remember me?</span>
 <span style="color: #ff1493;">(</span>-filter
  less-than-ten-p
  <span style="color: #7fff00;">(</span>-filter
   more-than-five-p
   xs<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 6 7 8 9</span>
</pre>
</div>

<p>
What this does is filter the whole collection and then filter again the
smaller collection. Of course, you can optimize this by composing the
predicates so that it would only filter once. However, the composition
of transducers and the laziness of streams, this is already inherent
about it. No need to optimize how the operations interact, it will be
optimized most of the time. This performance benefit alone is why I am
advocating transducers so that majority of the symbol stream can be
skipped and avoid heavily computing the candidates if possible. I think
<a href="https://github.com/Reactive-Extensions/RxJS">RxJS</a> has a better explanation of the optimization the API does when
composing mappings and predicates.
</p>

<p>
So with that, here is the long awaited candidate rater.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/rate-flex-match</span> <span style="color: #ff1493;">(</span>search target<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span>transducer-transduce-stream
   <span style="color: #7fff00;">(</span>transducer-composes
    <span style="color: #00bfff;">(</span>transducer-map-indexed #'cons<span style="color: #00bfff;">)</span>
    <span style="color: #00bfff;">(</span>transducer-first
     <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">(</span>pair<span style="color: #da70d6;">)</span>
       <span style="color: #da70d6;">(</span>string-equal <span style="color: #00ff7f;">(</span>cdr pair<span style="color: #00ff7f;">)</span> target<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
   <span style="color: #7fff00;">(</span>fb/flex-match-symbol-stream
    search
    <span style="color: #00bfff;">(</span>fb/function-symbol-stream<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
What this returns is a single valued stream of a cons pair where the car
is the index of the target function in the sorted candidate list
generated by <code>smex</code>. The index will be our rating: if the target appears
first on the list, the rating would be 0. What we want is a rating of 0
but you can be a bit more loose if you don't mind scrolling a bit to
select the command. Since the return value is a stream, you have to
unwrap with preferably <code>stream-to-list</code> and get the first value, just
take note.
</p>

<p>
So let's take all this to one proof.
</p>
</div>
</div>
