hacker/_posts/2016-09-13-Best Flex Matcher.org
* Checkpoint

With the generator and the rater, we can now make a working code.

#+BEGIN_SRC emacs-lisp
  ;; Just a simple check if the target function exists.
  (defun fb/function-symbol-p (name)
    (not
     (null ;; Since the result is a list, we have to unwrap it
      (stream-to-list
       (transducer-transduce-stream
          (transducer-first (-partial #'string-equal name))
          (fb/function-symbol-stream))))))

  (defun fb/rate-flex-matcher (search-size target)
    ;; If the function does not exists, return a default stream value
    (if (not (fb/function-symbol-p target))
        (stream-stopped)
      (lexical-let*
          ((rater (-rpartial #'fb/rate-flex-match target))
           (rate-stream
            (transducer-transduce-stream
             (transducer-composes
              (transducer-filter
               (lambda (search)
                 (and
                  (not (string-empty-p search))
                  (<= (length search) search-size))))
              ;; My own filters
              ;; I prefer the first letter of the candidates be the same as the target
              (transducer-filter
               (lambda (search)
                 (string-equal
                  (substring-no-properties search 0 1)
                  (substring-no-properties target 0 1))))
              ;; No separators please
              (transducer-filter
               (lambda (search)
                 (not
                  (s-contains-p
                   "-"
                   search))))
              ;; End of my own filters
              (transducer-map
               (lambda (search)
                 (cons
                  search
                  (stream-to-list (funcall rater search)))))
              (transducer-filter
               (lambda (pair)
                 (and
                  (not (null (cdr pair))) ;; If a candidate was found
                  (= 0 (car (car (cdr pair))))))) ;; Iff the rating 0
              (transducer-map
               (lambda (pair)
                 (car pair))))
             (fb/text-forward-permutations target))))
        rate-stream)))
#+END_SRC

A little mouthful here but the outline is still the same: given a target
function name, generate all possible substrings, rate them, filter by
the highest rating and then tell me. The other thing here is that there
is =search-size= which limits the number of substrings to process.
Ideally, you want to type as little as possible so you should set it
near half the length of the target text but open for configuration.

There are other optimizations on my part. One, I would like the candidate and
target to have the first same letter as a hint. For example, with
=emacs-lisp-mode=, I want my candidates to begin with =e= so I can
easily remember it as being natural. Two, I would like no command
separator in the candidate because I don't type them. You can remove
both if you like.

Regardless of the logic, let's try it with the long awaited
=emacs-lisp-mode=

#+BEGIN_SRC emacs-lisp
  (require 'cl-lib)

  (cl-prettyprint (stream-to-list (fb/rate-flex-matcher 3 "emacs-lisp-mode")))

  ("ema" ; Take your pick for =emacs-lisp-mode=
   "emc"
   "emp"
   "eac"
   "eas"
   "eas"
   "eam"
   "ecs"
   "ecs"
   "ecm"
   "ecd"
   "esi"
   "esp"
   "esp"
   "epm"
   "epd")

  ;; Can we go lower?
  (cl-prettyprint (stream-to-list (fb/rate-flex-matcher 2 "emacs-lisp-mode")))

  nil ; No dice
#+END_SRC

Cool, it works. And at this point, you can try this out and walk out. If
you did try this out, you might experience several garbage collection if
you set =garbage-collection-messages= to =t= to see how many times. I
don't know about you but mine happened a lot but it didn't take too much
time but it is indicative of memory issues. Not a biggie but if it
garbage collects, it blocks the UI which is the whole point in the first
place.

However, the one thing we want is that it should not block the UI or be
asynchronous... sort of. Time for the bonus round.

