hacker/_posts/2016-09-13-Best Flex Matcher.html

<div id="outline-container-org28396e5" class="outline-2">
<h2 id="org28396e5">Checkpoint</h2>
<div class="outline-text-2" id="text-org28396e5">
<p>
With the generator and the rater, we can now make a working code.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Just a simple check if the target function exists.</span>
<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/function-symbol-p</span> <span style="color: #ff1493;">(</span>name<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span>not
   <span style="color: #7fff00;">(</span>null <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Since the result is a list, we have to unwrap it</span>
    <span style="color: #00bfff;">(</span>stream-to-list
     <span style="color: #ffff00;">(</span>transducer-transduce-stream
        <span style="color: #da70d6;">(</span>transducer-first <span style="color: #00ff7f;">(</span>-partial #'string-equal name<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
        <span style="color: #da70d6;">(</span>fb/function-symbol-stream<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/rate-flex-matcher</span> <span style="color: #ff1493;">(</span>search-size target<span style="color: #ff1493;">)</span>
  <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">If the function does not exists, return a default stream value</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> <span style="color: #7fff00;">(</span>not <span style="color: #00bfff;">(</span>fb/function-symbol-p target<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
      <span style="color: #7fff00;">(</span>stream-stopped<span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span>
        <span style="color: #00bfff;">(</span><span style="color: #ffff00;">(</span>rater <span style="color: #da70d6;">(</span>-rpartial #'fb/rate-flex-match target<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
         <span style="color: #ffff00;">(</span>rate-stream
          <span style="color: #da70d6;">(</span>transducer-transduce-stream
           <span style="color: #00ff7f;">(</span>transducer-composes
            <span style="color: #ff8247;">(</span>transducer-filter
             <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8c00;">(</span>search<span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">and</span>
                <span style="color: #ff1493;">(</span>not <span style="color: #7fff00;">(</span>string-empty-p search<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
                <span style="color: #ff1493;">(</span>&lt;= <span style="color: #7fff00;">(</span>length search<span style="color: #7fff00;">)</span> search-size<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
            <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">My own filters</span>
            <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">I prefer the first letter of the candidates be the same as the target</span>
            <span style="color: #ff8247;">(</span>transducer-filter
             <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8c00;">(</span>search<span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span>string-equal
                <span style="color: #ff1493;">(</span>substring-no-properties search 0 1<span style="color: #ff1493;">)</span>
                <span style="color: #ff1493;">(</span>substring-no-properties target 0 1<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
            <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">No separators please</span>
            <span style="color: #ff8247;">(</span>transducer-filter
             <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8c00;">(</span>search<span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span>not
                <span style="color: #ff1493;">(</span>s-contains-p
                 <span style="color: #68f6cb;">"-"</span>
                 search<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
            <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">End of my own filters</span>
            <span style="color: #ff8247;">(</span>transducer-map
             <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8c00;">(</span>search<span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span>cons
                search
                <span style="color: #ff1493;">(</span>stream-to-list <span style="color: #7fff00;">(</span>funcall rater search<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span>
            <span style="color: #ff8247;">(</span>transducer-filter
             <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8c00;">(</span>pair<span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">and</span>
                <span style="color: #ff1493;">(</span>not <span style="color: #7fff00;">(</span>null <span style="color: #00bfff;">(</span>cdr pair<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">If a candidate was found</span>
                <span style="color: #ff1493;">(</span>= 0 <span style="color: #7fff00;">(</span>car <span style="color: #00bfff;">(</span>car <span style="color: #ffff00;">(</span>cdr pair<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Iff the rating 0</span>
            <span style="color: #ff8247;">(</span>transducer-map
             <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8c00;">(</span>pair<span style="color: #ff8c00;">)</span>
               <span style="color: #ff8c00;">(</span>car pair<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
           <span style="color: #00ff7f;">(</span>fb/text-forward-permutations target<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      rate-stream<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
A little mouthful here but the outline is still the same: given a target
function name, generate all possible substrings, rate them, filter by
the highest rating and then tell me. The other thing here is that there
is <code>search-size</code> which limits the number of substrings to process.
Ideally, you want to type as little as possible so you should set it
near half the length of the target text but open for configuration.
</p>

<p>
There are other optimizations on my part. One, I would like the candidate and
target to have the first same letter as a hint. For example, with
<code>emacs-lisp-mode</code>, I want my candidates to begin with <code>e</code> so I can
easily remember it as being natural. Two, I would like no command
separator in the candidate because I don't type them. You can remove
both if you like.
</p>

<p>
Regardless of the logic, let's try it with the long awaited
<code>emacs-lisp-mode</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">require</span> '<span style="color: #afc0fd; font-weight: bold;">cl-lib</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>stream-to-list <span style="color: #7fff00;">(</span>fb/rate-flex-matcher 3 <span style="color: #68f6cb;">"emacs-lisp-mode"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span><span style="color: #68f6cb;">"ema"</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">Take your pick for =emacs-lisp-mode=</span>
 <span style="color: #68f6cb;">"emc"</span>
 <span style="color: #68f6cb;">"emp"</span>
 <span style="color: #68f6cb;">"eac"</span>
 <span style="color: #68f6cb;">"eas"</span>
 <span style="color: #68f6cb;">"eas"</span>
 <span style="color: #68f6cb;">"eam"</span>
 <span style="color: #68f6cb;">"ecs"</span>
 <span style="color: #68f6cb;">"ecs"</span>
 <span style="color: #68f6cb;">"ecm"</span>
 <span style="color: #68f6cb;">"ecd"</span>
 <span style="color: #68f6cb;">"esi"</span>
 <span style="color: #68f6cb;">"esp"</span>
 <span style="color: #68f6cb;">"esp"</span>
 <span style="color: #68f6cb;">"epm"</span>
 <span style="color: #68f6cb;">"epd"</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Can we go lower?</span>
<span style="color: #ff8c00;">(</span>cl-prettyprint <span style="color: #ff1493;">(</span>stream-to-list <span style="color: #7fff00;">(</span>fb/rate-flex-matcher 2 <span style="color: #68f6cb;">"emacs-lisp-mode"</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

nil <span style="color: #2872b2;">; </span><span style="color: #2872b2;">No dice</span>
</pre>
</div>

<p>
Cool, it works. And at this point, you can try this out and walk out. If
you did try this out, you might experience several garbage collection if
you set <code>garbage-collection-messages</code> to <code>t</code> to see how many times. I
don't know about you but mine happened a lot but it didn't take too much
time but it is indicative of memory issues. Not a biggie but if it
garbage collects, it blocks the UI which is the whole point in the first
place.
</p>

<p>
However, the one thing we want is that it should not block the UI or be
asynchronous&#x2026; sort of. Time for the bonus round.
</p>
</div>
</div>
