hacker/_posts/2016-09-13-Best Flex Matcher.org
* Promises

This is the last piece to build delayed and buffered streams and this
might get hairy as I am running out of documentation. The only
assumption I have for you is that you know how to use [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise][promises]]. Read
about if you don't or we can just jump in.

Again if we have a list of a million items, it would still take time
processing all of it. What if we can buffer it by time? Given a time
period and stream, accumulate values into a list until the period is
done. This can be implemented like so.

#+BEGIN_SRC emacs-lisp
  (defun fb/stream-time-buffered (buffer-time stream)
    (stream
     (lambda (&rest args)
       (lexical-let ((initial-value (apply stream args))
                     (done nil)
                     (now (current-time)))
         (when (stream-start-value-p initial-value)
           (setq initial-value (apply stream args)))
         (if (stream-stop-value-p initial-value)
             stream-stop
           (promise
            (lambda (res rej)
              (lexical-let ((buffered-values (list initial-value))
                            (elapsed-time (float-time (time-subtract (current-time) now)))
                            (current-value initial-value))
                (while (and (not done)
                            (< elapsed-time buffer-time))
                  (if (stream-stop-value-p current-value)
                      (setq done t)
                    (push current-value buffered-values)
                    (setq current-value (apply stream args))
                    (setq elapsed-time (float-time (time-subtract (current-time) now)))))
                (funcall res (reverse buffered-values))))))))))
#+END_SRC

Much in the implementation of a stream but the idea is in
=buffered-values= and =elapsed-time= and probably =promises=. Let's see
this with a huge list.

#+BEGIN_SRC emacs-lisp
  (setq range (number-sequence 1 100000)
        stream (stream-from-list range)
        period (/ 30.0) ; 30fps
        buffered-stream (fb/stream-time-buffered period stream))

  ;; Your results might vary
  (princ (funcall buffered-stream)) ;;> stream-started

  (princ (funcall buffered-stream)) ;;> 1 ... 4928

  (princ (funcall buffered-stream)) ;;> 4929 ... 9753
#+END_SRC

Ideally, the combination of this and =run-with-idle-timer= prevents
blocking the UI. And here comes =promise.el= or it can be replaced with
the mature [[https://github.com/kiwanami/emacs-deferred][deferred]] elisp library but the idea here is that it returns a
promise like value when completed returns the number of values
accumulated. Generalizing this.

#+BEGIN_SRC emacs-lisp
  (defun fb/async-write-stream (file stream)
    (with-temp-file file
      (erase-buffer))
    (letrec ((async-stream
              (fb/stream-time-buffered
               fb/frame-rate
               stream))
             (recurser
              (lambda ()
                (let ((value (funcall async-stream)))
                  (when (stream-start-value-p value)
                    (setq value (funcall async-stream)))
                  (if (stream-stop-value-p value)
                      (message "Done")
                    (promise-then
                     value
                     (lambda (values)
                       (when values
                         (append-to-file
                          (concat
                           (string-join
                            values
                            "\n")
                           "\n")
                          nil
                          file))
                       (run-with-idle-timer
                        fb/frame-rate
                        nil
                        recurser))))))))
      (funcall recurser)))
#+END_SRC

What this does is write the buffered values to a file of a stream. It is
a bit rudimentary since you can't stop it once you start it but this is
the main attempt to buffer and asynchronously write values... sort of.
You don't need to understand but the idea here is with the promise
stream, you get one value, wait for it to fulfill, write the fulfilled
values, wait for some delay to avoid blocking the UI, get another
promise value and repeat until it is consumed. But let me try it for
you.

#+BEGIN_SRC emacs-lisp
  (fb/async-write-stream
   "~/result"
   (fb/rate-flex-matcher 4 "emacs-lisp-mode"))

  ;; After you see the "Done" message
  (insert-file-contents "~/result")

  ;; Output here
  ;; emac
  ;; emas
  ;; emas
  ;; emai
  ;; emai
  ;; emas
  ;; emap
  ;; emam
  ;; emao
  ;; emad
  ;; emad
  ;; emcs
  ;; emcs
  ;; emci
  ;; emci
  ;; emcs
  ;; emcp
  ;; emco
  ;; emco
  ;; emc
  ;; emcd
  ;; emsl
  ;; emsl
  ;; emsi
  ;; emsp
  ;; emsp
  ;; emlp
  ;; emlp
  ;; emis
  ;; emio
  ;; emio
  ;; emid
  ;; empm
  ;; empm
  ;; empo
  ;; emp
  ;; empd
  ;; eacs
  ;; eacs
  ;; eaci
  ;; eaci
  ;; eacs
  ;; eacp
  ;; eaco
  ;; eaco
  ;; eac
  ;; eacd
  ;; easl
  ;; easl
  ;; easi
  ;; easp
  ;; easp
  ;; easm
  ;; easo
  ;; eas
  ;; easd
  ;; eals
  ;; eals
  ;; ealm
  ;; eais
  ;; eais
  ;; eaim
  ;; easp
  ;; easp
  ;; easm
  ;; easo
  ;; eas
  ;; easd
  ;; ease
  ;; eapd
  ;; eapd
  ;; eamo
  ;; eam
  ;; eamd
  ;; eame
  ;; eaod
  ;; ecsl
  ;; ecsl
  ;; ecss
  ;; ecss
  ;; ecsp
  ;; ecsm
  ;; ecso
  ;; ecsd
  ;; ecsd
  ;; ecls
  ;; ecls
  ;; eclm
  ;; ecis
  ;; ecis
  ;; ecim
  ;; ecsp
  ;; ecsp
  ;; ecsm
  ;; ecso
  ;; ecs
  ;; ecse
  ;; ecse
  ;; ecpm
  ;; ecmo
  ;; ecmo
  ;; ecm
  ;; ecmd
  ;; ecme
  ;; ecod
  ;; ecd
  ;; esli
  ;; esli
  ;; esis
  ;; esis
  ;; esip
  ;; esim
  ;; esio
  ;; esi
  ;; esie
  ;; esie
  ;; espm
  ;; espm
  ;; espo
  ;; esp
  ;; espd
  ;; elis
  ;; elis
  ;; elid
  ;; elpm
  ;; elpm
  ;; eisp
  ;; eisp
  ;; eipm
  ;; espm
  ;; espm
  ;; espo
  ;; esp
  ;; espd
  ;; epmo
  ;; epmo
  ;; epm
  ;; epmd
  ;; epme
  ;; epod
  ;; epd
#+END_SRC

It sort of works if you try it, the only thing I can add is to change
the promise delay by higher idle time as well as account for garbage
collection time. However, the idea of non-blocking Emacs might not be
far off but it does take some effort to do so. I do want to stress for
this final leg, that promises or deferred objects are used in
conjunction with streams so that computation time is not noticeable to
appear blocking. Again, the garbage collection looms if you have it
turned on and that the responsiveness takes a dip from time to time.

