hacker/_posts/2016-09-13-Best Flex Matcher.html

<div id="outline-container-org1d4666c" class="outline-2">
<h2 id="org1d4666c">Promises</h2>
<div class="outline-text-2" id="text-org1d4666c">
<p>
This is the last piece to build delayed and buffered streams and this
might get hairy as I am running out of documentation. The only
assumption I have for you is that you know how to use <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise">promises</a>. Read
about if you don't or we can just jump in.
</p>

<p>
Again if we have a list of a million items, it would still take time
processing all of it. What if we can buffer it by time? Given a time
period and stream, accumulate values into a list until the period is
done. This can be implemented like so.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/stream-time-buffered</span> <span style="color: #ff1493;">(</span>buffer-time stream<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span>stream
   <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #00bfff;">(</span><span style="color: #f5b55f;">&amp;rest</span> args<span style="color: #00bfff;">)</span>
     <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let</span> <span style="color: #ffff00;">(</span><span style="color: #da70d6;">(</span>initial-value <span style="color: #00ff7f;">(</span>apply stream args<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
                   <span style="color: #da70d6;">(</span>done nil<span style="color: #da70d6;">)</span>
                   <span style="color: #da70d6;">(</span>now <span style="color: #00ff7f;">(</span>current-time<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
       <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> <span style="color: #da70d6;">(</span>stream-start-value-p initial-value<span style="color: #da70d6;">)</span>
         <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> initial-value <span style="color: #00ff7f;">(</span>apply stream args<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
       <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> <span style="color: #da70d6;">(</span>stream-stop-value-p initial-value<span style="color: #da70d6;">)</span>
           stream-stop
         <span style="color: #da70d6;">(</span>promise
          <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8247;">(</span>res rej<span style="color: #ff8247;">)</span>
            <span style="color: #ff8247;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let</span> <span style="color: #9cb6ad;">(</span><span style="color: #ff8c00;">(</span>buffered-values <span style="color: #ff1493;">(</span>list initial-value<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
                          <span style="color: #ff8c00;">(</span>elapsed-time <span style="color: #ff1493;">(</span>float-time <span style="color: #7fff00;">(</span>time-subtract <span style="color: #00bfff;">(</span>current-time<span style="color: #00bfff;">)</span> now<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
                          <span style="color: #ff8c00;">(</span>current-value initial-value<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
              <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">while</span> <span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">and</span> <span style="color: #ff1493;">(</span>not done<span style="color: #ff1493;">)</span>
                          <span style="color: #ff1493;">(</span>&lt; elapsed-time buffer-time<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
                <span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> <span style="color: #ff1493;">(</span>stream-stop-value-p current-value<span style="color: #ff1493;">)</span>
                    <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> done t<span style="color: #ff1493;">)</span>
                  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">push</span> current-value buffered-values<span style="color: #ff1493;">)</span>
                  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> current-value <span style="color: #7fff00;">(</span>apply stream args<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
                  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> elapsed-time <span style="color: #7fff00;">(</span>float-time <span style="color: #00bfff;">(</span>time-subtract <span style="color: #ffff00;">(</span>current-time<span style="color: #ffff00;">)</span> now<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span>
              <span style="color: #9cb6ad;">(</span>funcall res <span style="color: #ff8c00;">(</span>reverse buffered-values<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Much in the implementation of a stream but the idea is in
<code>buffered-values</code> and <code>elapsed-time</code> and probably <code>promises</code>. Let's see
this with a huge list.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> range <span style="color: #ff1493;">(</span>number-sequence 1 100000<span style="color: #ff1493;">)</span>
      stream <span style="color: #ff1493;">(</span>stream-from-list range<span style="color: #ff1493;">)</span>
      period <span style="color: #ff1493;">(</span>/ 30.0<span style="color: #ff1493;">)</span> <span style="color: #2872b2;">; </span><span style="color: #2872b2;">30fps</span>
      buffered-stream <span style="color: #ff1493;">(</span>fb/stream-time-buffered period stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Your results might vary</span>
<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall buffered-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; stream-started</span>

<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall buffered-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 1 ... 4928</span>

<span style="color: #ff8c00;">(</span>princ <span style="color: #ff1493;">(</span>funcall buffered-stream<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;;</span><span style="color: #2872b2;">&gt; 4929 ... 9753</span>
</pre>
</div>

<p>
Ideally, the combination of this and <code>run-with-idle-timer</code> prevents
blocking the UI. And here comes <code>promise.el</code> or it can be replaced with
the mature <a href="https://github.com/kiwanami/emacs-deferred">deferred</a> elisp library but the idea here is that it returns a
promise like value when completed returns the number of values
accumulated. Generalizing this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fb/async-write-stream</span> <span style="color: #ff1493;">(</span>file stream<span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">with-temp-file</span> file
    <span style="color: #7fff00;">(</span>erase-buffer<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">letrec</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>async-stream
            <span style="color: #ffff00;">(</span>fb/stream-time-buffered
             fb/frame-rate
             stream<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
           <span style="color: #00bfff;">(</span>recurser
            <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #da70d6;">()</span>
              <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">let</span> <span style="color: #00ff7f;">(</span><span style="color: #ff8247;">(</span>value <span style="color: #9cb6ad;">(</span>funcall async-stream<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
                <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> <span style="color: #ff8247;">(</span>stream-start-value-p value<span style="color: #ff8247;">)</span>
                  <span style="color: #ff8247;">(</span><span style="color: #96a5d9; font-weight: bold;">setq</span> value <span style="color: #9cb6ad;">(</span>funcall async-stream<span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span>
                <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">if</span> <span style="color: #ff8247;">(</span>stream-stop-value-p value<span style="color: #ff8247;">)</span>
                    <span style="color: #ff8247;">(</span>message <span style="color: #68f6cb;">"Done"</span><span style="color: #ff8247;">)</span>
                  <span style="color: #ff8247;">(</span>promise-then
                   value
                   <span style="color: #9cb6ad;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ff8c00;">(</span>values<span style="color: #ff8c00;">)</span>
                     <span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> values
                       <span style="color: #ff1493;">(</span>append-to-file
                        <span style="color: #7fff00;">(</span>concat
                         <span style="color: #00bfff;">(</span>string-join
                          values
                          <span style="color: #68f6cb;">"\n"</span><span style="color: #00bfff;">)</span>
                         <span style="color: #68f6cb;">"\n"</span><span style="color: #7fff00;">)</span>
                        nil
                        file<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
                     <span style="color: #ff8c00;">(</span>run-with-idle-timer
                      fb/frame-rate
                      nil
                      recurser<span style="color: #ff8c00;">)</span><span style="color: #9cb6ad;">)</span><span style="color: #ff8247;">)</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>funcall recurser<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
What this does is write the buffered values to a file of a stream. It is
a bit rudimentary since you can't stop it once you start it but this is
the main attempt to buffer and asynchronously write values&#x2026; sort of.
You don't need to understand but the idea here is with the promise
stream, you get one value, wait for it to fulfill, write the fulfilled
values, wait for some delay to avoid blocking the UI, get another
promise value and repeat until it is consumed. But let me try it for
you.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>fb/async-write-stream
 <span style="color: #68f6cb;">"~/result"</span>
 <span style="color: #ff1493;">(</span>fb/rate-flex-matcher 4 <span style="color: #68f6cb;">"emacs-lisp-mode"</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">After you see the "Done" message</span>
<span style="color: #ff8c00;">(</span>insert-file-contents <span style="color: #68f6cb;">"~/result"</span><span style="color: #ff8c00;">)</span>

<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Output here</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emac</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emas</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emas</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emai</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emai</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emas</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emap</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emam</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emao</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emad</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emad</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emcs</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emcs</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emci</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emci</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emcs</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emcp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emco</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emco</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emc</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emcd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emsl</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emsl</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emsi</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emsp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emsp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emlp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emlp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emis</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emio</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emio</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emid</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">empm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">empm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">empo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">emp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">empd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eacs</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eacs</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eaci</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eaci</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eacs</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eacp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eaco</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eaco</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eac</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eacd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easl</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easl</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easi</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eas</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eals</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eals</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ealm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eais</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eais</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eaim</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eas</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">easd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ease</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eapd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eapd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eamo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eam</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eamd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eame</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eaod</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsl</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsl</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecss</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecss</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecso</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecls</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecls</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eclm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecis</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecis</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecim</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecsm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecso</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecs</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecse</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecse</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecpm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecmo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecmo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecmd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecme</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecod</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">ecd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esli</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esli</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esis</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esis</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esip</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esim</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esio</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esi</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esie</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esie</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">elis</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">elis</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">elid</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">elpm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">elpm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eisp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eisp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">eipm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">esp</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">espd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">epmo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">epmo</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">epm</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">epmd</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">epme</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">epod</span>
<span style="color: #2872b2;">;; </span><span style="color: #2872b2;">epd</span>
</pre>
</div>

<p>
It sort of works if you try it, the only thing I can add is to change
the promise delay by higher idle time as well as account for garbage
collection time. However, the idea of non-blocking Emacs might not be
far off but it does take some effort to do so. I do want to stress for
this final leg, that promises or deferred objects are used in
conjunction with streams so that computation time is not noticeable to
appear blocking. Again, the garbage collection looms if you have it
turned on and that the responsiveness takes a dip from time to time.
</p>
</div>
</div>
