hacker/_posts/2016-09-13-Best Flex Matcher.org
* Notes

So we achieved our goal of getting the best candidates for flex matched
commands and then toyed around with streams and transducers and a little
bit of promises with inspirations from Clojure and Javascript. I feel
the latter was more fun to experiment on further but I have written too
much now for just a little problem in efficiency. Much ado about nothing.
